app/views/templates/show.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."template_id" = $2 LIMIT $3  [["user_id", 1], ["template_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "templates" INNER JOIN "bookmarks" ON "templates"."id" = "bookmarks"."template_id" WHERE "bookmarks"."user_id" = $1 AND "templates"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
              <div class="flex space-x-2">
                <% if current_user.bookmarked_templates.include?(@template) %>
                  <%= button_to 'ブックマーク解除', template_bookmark_path(@template, current_user.bookmarks.find_by(template: @template)), method: :delete, class: "btn btn-danger" %>

SELECT 1 AS one FROM "templates" INNER JOIN "bookmarks" ON "templates"."id" = "bookmarks"."template_id" WHERE "bookmarks"."user_id" = $1 AND "templates"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."template_id" = $2 LIMIT $3  [["user_id", 1], ["template_id", 3], ["LIMIT", 1]]
---
              <div class="flex space-x-2">
                <% if current_user.bookmarked_templates.include?(@template) %>
                  <%= button_to 'ブックマーク解除', template_bookmark_path(@template, current_user.bookmarks.find_by(template: @template)), method: :delete, class: "btn btn-danger" %>