app/controllers/bookmarks_controller.rb

  def create
    @template = Template.find(params[:template_id])
    current_user.bookmarked_templates << @template
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user_id", "template_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["template_id", 3], ["created_at", "2024-10-01 00:21:23.906808"], ["updated_at", "2024-10-01 00:21:23.906808"]]

  def destroy
    @template = Template.find(params[:template_id])
    current_user.bookmarked_templates.delete(@template)
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."template_id" = $2  [["user_id", 1], ["template_id", 3]]