app/controllers/templates_controller.rb

  def create
    @template = current_user.templates.build(template_params)
    if @template.save
---
INSERT INTO "templates" ("title", "body", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @template.destroy
---
DELETE FROM "templates" WHERE "templates"."id" = $1  [["id", 1]]

  def set_template
    @template = Template.find_by(id: params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]