app/controllers/top_controller.rb

  def index
    @templates = Template.includes(:user)
---
SELECT "templates".* FROM "templates"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]