app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    Rails.logger.debug "User params: #{user_params.inspect}"
    if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "name", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "avatar" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-09-20 00:31:56.873551"], ["avatar", "icon.png"], ["id", 1]]